Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: བྲམ་ཟེའི་ཁྱེའུ་དེས་ཤེས་ནས་དེ་དེའི་ཐད་དུ་སོང་སྟེ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: The young brahmin knew him and went to him, bowed down at his feet, and sat before him to listen to the Dharma.

source: དེ་ནས་དྲང་སྲོང་དེས་ཀྱང་དེ་ལ་ངེས་པར་འབྱུང་བའི་བསྔགས་པ་བརྗོད་ནས།
en: Thereupon the sage spoke in praise of renunciation,

source: དེ་ཐོས་མ་ཐག་ཏུ་དེ་ངེས་པར་འབྱུང་བ་དང་འཐུན་པའི་སེམས་སྐྱེས་ཏེ།
en: and when he heard him the young brahmin immediately made up his mind to go forth.

source: དེ་དྲང་སྲོང་དེ་ཉིད་ལས་རབ་ཏུ་བྱུང་ནས་ནགས་ཁྲོད་དེ་ན་གནས་ཀྱང་དེས་ཁྱད་པར་ཅི་ཡང་མ་ཐོབ་བོ། །
en: He went forth in the presence of the sage and lived in the forest, but he did not achieve anything of significance.

source: དེ་ནས་ཕྱི་ཞིག་ན་དྲང་སྲོང་དེ་ཤི་ནས་གེལ་པོ་དེ་ཡང་དཀའ་ཐུབ་ཀྱི་གནས་དེ་ཉིད་ན་གནས་སོ། །
en: One day the sage died, but Fleshy still stayed on at the hermitage.

source: དེ་ནས་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཤུར་པ་ར་ཀར་གཤེགས་པ་ན། ཁྱེའུ་གེལ་པོས་བཅོམ་ལྡན་འདས་རྒྱང་ནས་གཤེགས་པ་མཐོང་ངོ་། །
en: Then as the Blessed One was traveling to Śūrpāraka, young Fleshy saw the Blessed One approaching in the distance.

source: མཐོང་མ་ཐག་ཏུ་བསམས་པ། འདི་ནི་ཤཱཀྱའི་རིགས་དཀའ་བ་མཛད་པ་ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས་པ་དེ་ཡིན་ཏེ།
en: As soon as he saw him, he thought, “That’s the ascetic of the Śākya clan—the omniscient, all-seeing one.

source: ལམ་འདི་ནས་ཚུར་གཤེགས་ཀྱིས།
en: Here he comes down the path!

source: བདག་གིས་བསྙེན་བཀུར་མི་བྱར་མི་རུང་ངོ་སྙམ་ནས།
en: It wouldn’t be right for me not to show my respect and offer my help.”

source: ཡང་དེས་བསམས་པ། གལ་ཏེ་བདག་བྲག་འདི་ལས་རྐང་གིས་བབས་ན་ནི། བཅོམ་ལྡན་འདས་ཐལ་བར་འགྱུར་གྱིས།
en: “If I clamber down from this boulder on foot, the Blessed One will have passed by.

source: བྲག་ཀ་འདི་ནས་བདག་གིས་མཆོངས་པ་དང་བདག་གིས་བསྙེན་བཀུར་བྱེད་ཁོམ་མོ་སྙམ་དུ་བསམས་ནས་བྲག་ཀ་དེ་ཉིད་ནས་མཆོངས་སོ། །
en: I will leap from the boulder so that I can show my respect and offer my help.” Having thought this, he leapt from the boulder.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེར་ས་གཞི་སྟན་ཤིང་བལ་གྱི་ནང་ཚངས་ཅན་འདྲ་བར་བྱིན་གྱིས་བརླབས་ནས། དེ་ལྷུང་མ་ཐག་ཏུ་རྐང་པ་འགྲེང་བར་གྱུར་ཏེ། དེ་དགའ་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Just then the Blessed One blessed the ground so that it became like a cotton cushion stuffed with wool, and so that when young Fleshy landed, he sprang right back up on his feet, delighted.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱི་བཞིན་དུ་འབྲང་ངོ་། །
en: He went to where the Blessed One was, touched his head to the Blessed One’s feet, and followed after him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་ལམ་ནས་བཟུང་སྟེ་ཕྱོགས་གཅིག་ཏུ་བཞུགས་ནས།
en: Out of compassion for him, the Blessed One stepped off the path and sat down nearby.

source: དེས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: Again Fleshy touched his head to the Blessed One’s feet and then sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One taught him the Dharma particularly suited to him,

source: དེས་ན་བྲམ་ཟེའི་ཁྱེའུ་གེལ་པོས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་བདེན་པ་རྟོགས་པའི་མོད་ལ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ་
en: and when he heard it he destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of non-return right where he sat.

source: དེས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After seeing the truths, he rose from his seat, drew down the right shoulder of his upper garment, bowed toward the Blessed One with palms pressed together, and requested of the Blessed One,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་དེ་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: With the words “Come, join me, monk! Practice the holy life,” the Blessed One led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: དེ་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས་གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ་
en: As an arhat, free from the attachments of the three realms, his mind regarded gold no differently than filth, and the palms of his hands as like space itself.

source: རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་མི་ལྟ་བ་དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: He achieved the insights, superknowledges, and discriminations. He had no regard for worldly profit, passion, or acclaim. His state was such that Indra, Upendra, and the other gods worshiped and venerated him and addressed him with respect.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དད་པ་དང་མོས་པ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: The Blessed One also commended him as foremost among the faithful and devoted.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་ཚེ་དང་ལྡན་པ་གེལ་པོས་བཅོམ་ལྡན་འདས་མཐོང་ནས།
en: “Lord,” the monks requested the Blessed One, “tell us why Venerable Fleshy leapt from a boulder when he saw the Blessed One,

source: བྲག་ཀ་ནས་རང་གིས་མཆོངས་པ་དང་གཞན་ཡང་འདིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེདགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་པ་ལ་གཟིགས།
en: and why he pleased the Blessed One, did not displease him, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟ་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་འདིས་ཇི་ལྟར་ང་མཐོང་ནས་བྲག་ཀ་ནས་རང་གིས་མཆོངས་ཏེ། ངའི་ཐད་དུ་རབ་ཏུ་བྱུང་ནས་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, upon seeing me he leapt from a boulder, went forth in my presence, and generated the four meditative states and five superknowledges. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། དྲང་སྲོང་ཞིག་འཁོར་ལྔ་བརྒྱ་དང་ལམ་དུ་ཞུགས་ཏེ།
en: “Monks, in times gone by, a certain sage was traveling a path with five hundred of his disciples.

source: དེ་བྲག་དྲུང་ལོགས་ནས་འགྲོ་བ་ལས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Upon reaching the face of a boulder, they took a seat at one side.

source: བྲག་དེའི་ཁ་ན་ནི་དཀའ་ཐུབ་ཅན་ཞིག་འདུག་པ་ལས། དེས་དྲང་སྲོང་བྲག་དྲུང་དེ་ན་འདུག་པ་དེ་མཐོང་ནས།
en: There was an ascetic living on top of that boulder, practicing his austerities.

source: མཐོང་མ་ཐག་ཏུ་དེ་ལ་ཤིན་ཏུ་དགའ་བ་སྐྱེས་ཏེ། དེས་བསམས་པ།
en: He saw the sage sitting at the foot of the boulder, felt a surge of joy at the sight of him, and thought,

source: བདག་དྲང་སྲོང་དེ་ལ་བསྙེན་བཀུར་བྱེད་དུ་འགྲོའོ་སྙམ་ནས།
en: ‘I will show my respect to that sage and offer my help.’

source: དེས་ཡང་བསམས་པ་གལ་ཏེ་བདག་རྐང་གིས་བབས་ན་ནི་དྲང་སྲོང་དེ་ཐལ་དུ་འོང་ངོ་སྙམ་ནས།
en: Then he thought, ‘But if I clamber down on foot, the sage will have left.’

source: རང་གིས་བྲག་དེའི་ཁ་ནས་མཆོངས་པ་ལས། དྲང་སྲོང་དེས་ལྷ་ལ་བསྒོ་ནས་ལག་ནས་བཟུང་སྟེ་ས་ལ་བཞག་གོ། །
en: “So he leapt from the boulder, and as he did so the sage dispatched a deity who took him in his hands and placed him on the ground.

source: དེ་ནས་དེའི་ཐད་དུ་སོང་སྟེ་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་ཆོས་མཉན་པའི་ཕྱིར་མདུན་དུ་འདུག་གོ། །
en: Then the ascetic approached the sage, bowed down at his feet, and sat before him to listen to the Dharma.

source: དེ་ནས་དྲང་སྲོང་དེས་དེ་ལ་ངེས་པར་འབྱུང་བ་དང་འཐུན་པའི་གཏམ་བྱས་ནས། དེ་དེའི་ཐད་དུ་རབ་ཏུ་བྱུང་ངོ་། །
en: “The sage spoke in praise of renunciation, and the ascetic went forth in his presence.

source: དེ་རབ་ཏུ་བྱུང་ནས་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: After going forth, he generated the four meditative states and five superknowledges.

source: དེའི་ཚེ་དཀའ་ཐུབ་ཅན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་གེལ་པོ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that ascetic then is none other than Fleshy.

source: དེའི་ཚེ་ཡང་འདིས་ང་མཐོང་ནས་བྲག་ཀ་ནས་རང་གིས་མཆོངས་ཏེ། ངའི་ཐད་དུ་རབ་ཏུ་བྱུང་ནས་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ་ད་ལྟར་ཡང་ང་མཐོང་ནས་བྲག་ཀ་ནས་རང་གིས་མཆོངས་ཏེ།
en: At that time when he saw me he leapt from a boulder, went forth in my presence, and generated the four meditative states and the five superknowledges.

source: ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Now as well, upon seeing me he leapt from a boulder, and went forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཡང་ཞུས་པ།
en: Again the monks inquired of the Blessed One,

source: བཙུན་པ་གེལ་པོ་འདིས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་འདིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ནསབཅོམ་ལྡན་འདས་ཀྱིས་དད་པ་དང་མོས་པ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་ལགས།
en: “Lord, what action did Fleshy take that ripened such that he pleased the Blessed One, did not displease him, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship, and that the Blessed One commended him as foremost among the faithful and devoted?”

source: གསོལ་པ། བཙུན་པ་འདིས་གང་དུ་སྨོན་ལམ་བཏབ་ལགས།
en: “Lord, where did he make these prayers?” they asked.

source: བཀའ་སྩལ་པ་དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” recounted the Blessed One, “in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world.

source: དེ་ཞབས་འབྲིང་འཁོར་ཉི་ཁྲི་དང་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ལས་ནགས་ཁྲོད་ཅིག་ཏུ་བྱོན་ཏེ། ནགས་ཁྲོད་དེ་ན་དྲང་སྲོང་ལྔ་བརྒྱ་འཁོད་དེ་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ཐག་རིང་པོ་ཞིག་ནས་མཐོང་ངོ་། །
en: “Traveling through the countryside with a retinue of twenty thousand attendants, he entered a certain dense forest where five hundred sages lived. The five hundred sages saw the Blessed One from a distance,

source: མཐོང་ནས་ཀྱང་དེ་དག་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: and upon seeing him they experienced a surge of joy.

source: དེ་དག་དགའ་བར་གྱུར་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་འཁོར་དང་བཅས་པ་དཀའ་ཐུབ་ཀྱི་གནས་སུ་རྩ་བ་དང་འབྲས་བུ་ལ་སྤྱན་དྲངས་ཏེ་ཕུལ་ལོ། །
en: In their joy they invited the totally and completely awakened Buddha Kāśyapa and his retinue to their forest devoted to austerities and there offered them roots and fruit.

source: དེ་ལྟར་ཕུལ་ནས་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འཁོད་དོ། །
en: After making this offering, they sat before him to listen to the Dharma.

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས། དེ་དག་གི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་ཤེས་པ་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ
en: “The totally and completely awakened Kāśyapa directly apprehended their thoughts, habitual tendencies, temperament, capacity, and nature, and taught them the Dharma accordingly.

source: དེ་ནས་དྲང་སྲོང་ལྔ་བརྒྱར་གཅིག་གིས་མ་ཚང་བ་རྣམས་ཀྱིས་བདེན་པ་རྟོགས་པའི་མོད་ལ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: “Then all but one of the five hundred sages immediately realized the truths and manifested the resultant state of non-return.

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After they saw the truths, they rose from their seats, drew down the right shoulder of their upper garments, bowed toward the Blessed Buddha Kāśyapa with palms pressed together, and requested,

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་དགེ་སློང་རྣམས་ལ་གཏད་ནས།
en: “Then the totally and completely awakened Kāśyapa presented the five hundred sages to the monks,

source: དགེ་སློང་རྣམས་ཀྱིས་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་དག་རབ་ཏུ་ཕྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་བྱས་ནས་དེ་དག་ལ་ལུང་ཡང་ཕོག་གོ། །
en: and the monks led all five hundred sages to go forth as novices, conferred on them full ordination, and instructed them.

source: དེ་དག་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དྲང་སྲོང་གཅིག་གིས་ནི་དེར་ཐ་ན་དྲོ་བ་ཙམ་གྱི་ཡོན་ཏན་ཡང་ཅུང་ཟད་ཀྱང་མ་ཐོབ་བོ། །
en: But one sage there did not attain a single good quality—he did not so much as generate heat.

source: དེ་གང་ལས་རབ་ཏུ་བྱུང་བའི་མཁན་པོ་དེ་ནི། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས། དད་པ་དང་མོས་པ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: “The totally and completely awakened Buddha Kāśyapa commended the preceptor who had led them to go forth as foremost among the faithful and devoted.

source: དེ་ནས་དེས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “After that, the one sage who did not attain anything practiced pure conduct all his life, and at the time of his death, he prayed,

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཇི་ལྟར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བདག་གི་མཁན་པོ་དད་པ་དང་མོས་པ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་བཞིན་དུ། བདག་ཀྱང་ཤཱཀྱ་ཐུབ་པ་ཤཱཀྱའི་རྒྱལ་པོའི་མཆོག་གིས་དད་པ་དང་མོས་པ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Just as the Buddha Kāśyapa commended my abbot as foremost among the faithful and devoted, so may I too be commended by Śākyamuni, the most excellent King of Śākyas, as foremost among the faithful and devoted.’

source: དེའི་ཚེ་དྲང་སྲོང་དུ་གྱུར་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་བ་གང་ཡིན་པ་དེ་ནི་གེལ་པོ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa then is none other than Fleshy.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ།
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེས་ཀྱང་བདག་དད་པ་དང་མོས་པ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པར་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: Just as the Buddha Kāśyapa commended my abbot as foremost among the faithful and devoted, so may I too be commended by Śākyamuni, the most excellent King of Śākyas, as foremost among the faithful and devoted.

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship,

source: ངས་འདི་དད་པ་དང་མོས་པ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ།། །།
en: and I have commended him as foremost among the faithful and devoted.”

source: ནག་པོ་ཞེས་བྱ་བ་ནི།
en: The Story of Black

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ། དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ན་བྲམ་ཟེ་འབྱུང་པོ་ཞེས་བྱ་བ་ཞིག་འདུག་སྟེ།
en: When the Blessed One was in Rājagṛha, there lived a brahmin named Bhūta .

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ན་མདོག་ནག་པོར་འདུག་གོ། །
en: and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, beautiful, and had a very dark complexion.

source: དེ་ནས་དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས།
en: At the elaborate feast celebrating his birth they asked,

source: ཁྱེའུ་འདིའི་མིང་ཅིར་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: “What name should we give this child?” And they named him, saying,

source: ཁྱེའུ་འདི་མདོག་ནག་པས་ན་དེའི་ཕྱིར་ཁྱེའུ་འདི་ནག་པོ་ཁོ་ནར་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: “Since this child has a very dark complexion, his name can only be Black.”

source: དེ་ནས་ཁྱེའུ་ནག་པོ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ་དེ་མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: Then they reared young Black on milk, yogurt, butter, ghee, and milk solids, and he flourished like a lotus in a lake.

source: དེ་ནས་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་། བྲམ་ཟེའི་སྤྱོད་ལམ་དང་། སྤྱོད་པ་དང་། ཨོཾ་ཞེས་བྱ་བ་དང་། བྷོ་ཞེས་བྱ་བ་དང་། གཙང་སྦྲ་དང་། ཆོ་ག་དང་། ཐལ་བ་བླང་བ་དང་། རིལ་བ་ཐོགས་པ་དང་། ངེས་བརྗོད་ཀྱི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་གྱི་རིག་བྱེད་དང་། སྙན་ཚིག་གི་རིག་བྱེད་དང་། སྲིད་སྲུང་གི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་བྱ་བ་དང་། མཆོད་སྦྱིན་བྱེད་དུ་གཞུག་པ་དང་། སྦྱིན་པ་དང་། བླང་བ་དང་། ཁ་ཏོན་བྱ་བ་དང་། ཁ་ཏོན་སློབ་ཏུ་གཞུག་པའི་ཐབས་བསླབས་ནས་ལས་རྣམ་པ་དྲུག་ལ་མཁས་པའི་བྲམ་ཟེར་གྱུར་ཏེདེ་མཐར་གྱིས་རིག་པའི་གནས་བཅྭ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: As he grew up, he studied letters, brahminical customs and conduct, the syllables oṃ and bho , ritual purity, ritual actions , the collection of ashes, holding the ritual vase, the Ṛg Veda , the Yajur Veda , the Sāma Veda , the Atharva Veda , how to perform sacrificial rites, how to lead others in performing sacrificial rites, how to give and receive offerings, recitation, and recitation instruction. Trained in these procedures, he became a master of the six types of brahminical activities, and in time he mastered the eighteen sciences.

source: དེའི་ཕ་ནི་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་ཙམ་ལ་བྲམ་ཟེའི་སྔགས་སློབ་པར་བྱེད་དོ། །
en: Black’s father taught brahmin mantras to some five hundred young brahmins.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་རྒས་པར་གྱུར་ཏེ་བསམས་པ།
en: One day, when he had become old, he thought,

source: ད་ནི་བདག་རྒས་པས་ཕྱིན་ཅད་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་པོ་འདི་རྣམས་སྔགས་སློབ་མི་ནུས་ཀྱིས།
en: “Now that I am old, I shall not be able to teach mantras to these five hundred young brahmins,

source: བདག་གིས་ཁྱེའུ་འདི་སྡེ་ཚན་གྱི་སློབ་དཔོན་བྱེད་དུ་གཞུག་གོ་སྙམ་ནས་
en: so I will put a leader in charge of the group.”

source: བུ་ལ་བསྒོ་བ།
en: So the father instructed his son,

source: བུ་ནག་པོ་ང་ནི་ད་རྒས་པས་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་པོ་འདི་དག་ཕྱིན་ཅད་སྔགས་སློབ་མི་ནུས་ལ།
en: “Black, my child, now that I am old, I shall not be able to teach mantras to these five hundred young brahmins.

source: ཁྱོད་ཀྱང་སྔགས་ཀྱི་མཐར་ཕྱིན་པ་ཡིན་གྱིས་བྲམ་ཟེའི་ཁྱེའུ་འདི་རྣམས་ཀྱི་སྔགས་ཀྱི་སློབ་དཔོན་གྱིས་ཤིག །
en: Since you are a master of mantras, you must lead these young brahmins in the study of mantras.”

source: བུས་སྨྲས་པ། མཁན་པོས་ཇི་སྐད་བཀའ་སྩལ་པ། དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་སྨྲས་ནསདེ་ནས་དེ་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་པོ་དེ་དག་སྔགས་སློབ་པ་ལ་ཞུགས་སོ། །
en: “As you wish, my preceptor,” the young man replied, and after that he began teaching mantras to the five hundred young brahmins.

source: དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་དེ་ཉིད་དུ་བྲམ་ཟེ་གཞན་ཞིག་གིས་མཆོད་སྦྱིན་བྱས་ཏེ། བྲམ་ཟེ་རྣམས་ལ་ཡོན་མང་པོ་ཕུལ་ལོ། །
en: Now, at that time there was another brahmin living in Rājagṛha who performed a sacrifice and offered many gifts to the brahmins.

source: མཆོད་སྦྱིན་བྱེད་པ་དེར་བྲམ་ཟེ་ཁ་ཅིག་ན་རེ་ཁོ་བོ་ཅག་ཡོན་དབང་གི་ཁྱེད་མི་དབང་ངོ་ཞེས་ཟེར་རོ། །
en: In the presence of the one who had performed the sacrifice, some of them said, “It is we who should collect these offerings. You others are not worthy to do so.”

source: གྲོང་ན་གནས་པ་རྣམས་ན་རེ། ངེད་ནི་དག་པ་ཡིན་གྱི་ཁྱེད་ནི་རྒྱལ་པོའི་ཞམ་རིང་བའི་གཡོག་བྱེད་པ་ཡིན་པས་ན།
en: Those of them who lived in town retorted, “We are pure, whereas you are servants of the king.

source: ཡོན་འདི་རྣམས་ངེད་དབང་གི་ཁྱེད་མི་དབང་ངོ་ཞེས་ཟེར་རོ། །
en: Therefore it is we who should collect these offerings, and not you.”

source: དེ་ནས་བྲམ་ཟེ་ནག་པོས་བསམས་པ།
en: The brahmin Black thought,

source: བྲམ་ཟེ་འདི་རྣམས་ཐབ་མོ་ཆེན་པོ་འབྱུང་སྟེ། གཞན་གྱིས་ནི་ཞི་བར་བྱེད་མི་ནུས་ཀྱིས་མ་ལ་ང་ཉིད་ཀྱིས་བསྒྲིམ་དགོས་སོ་སྙམ་དུ་བསམས་ནས།
en: “These brahmins are so quarrelsome that no one will be able to appease them. I’d better be careful.”

source: དེས་བྲམ་ཟེ་དེ་དག་དགག་པར་བརྩམ་པ་ལས་ཐབ་མོ་ཞི་བར་བྱེད་མ་ནུས་ནས།
en: He tried to get between them, but he could not keep the brahmins from quarreling.

source: དེ་གཞི་དེ་ལས་ཤས་ཆེར་སྐྱོ་བ་སྐྱེས་ཏེ།
en: This made him very sad.

source: བདག་གིས་འཁོར་རྣམས་གཏང་ལ་གཅིག་པུ་ནགས་ཁྲོད་དུ་གནས་བཅས་ཏེ་འདུག་པར་བྱའོ་སྙམ་ནས་དེས་འཁོར་དེ་རྣམས་བོར་ཏེ་ནགས་ཁྲོད་ཅིག་ཏུ་སོང་ངོ་། །
en: “I shall give up my retinue and go to live in the forest alone,” he thought, and he left behind his disciples and went into the forest.

source: ནགས་ཁྲོད་དེ་ན་གནོད་སྦྱིན་ནག་པོ་ཞེས་བྱ་བ་དྲག་ཅིང་འཇིགས་ལ་མདངས་འཕྲོག་པ་ཞིག་ཀྱང་གནས་ཏེ།
en: In that forest there lived a certain yakṣa, also named Black , who was fearsome and terrible.

source: དེས་སེམས་ཅན་སྟོང་ཕྲག་དུ་མ་གྱིན་ད་ལ་སྡུག་བསྔལ་སྐྱེད་པར་བྱེད་དོ། །
en: He drained the life out of others and caused suffering among thousands of beings.

source: ནགས་ཁྲོད་དེ་ན་དྲང་སྲོང་ཞིག་ཀྱང་གནས་ཏེ་དྲང་སྲོང་དེ་ལ་གནོད་སྦྱིན་དེ་ཤིན་ཏུ་དགའོ། །
en: There lived a sage in that forest as well, and when the yakṣa saw him he felt a surge of joy.

source: དེ་ནས་བྲམ་ཟེ་ནག་པོས་དྲང་སྲོང་དེ་ཐག་རིང་པོ་ཞིག་ནས་མཐོང་ངོ་། །
en: The brahmin Black saw the sage from a distance,

source: མཐོང་ནས་ཀྱང་དེ་ལ་དགའ་བར་གྱུར་ཏོ། །
en: and when he saw him, he too was filled with joy.

source: དགའ་བར་གྱུར་ནས་དེ་ཉིད་ཀྱི་ཐད་དུ་རབ་ཏུ་ཕྱུང་སྟེ། དེས་དེ་ལ་ཡིད་ལ་བྱ་བའི་ལུང་ཕོག་ནས། དེས་དེར་བསམས་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: In his joy he went forth in his presence, received instructions to ponder, and generated the four meditative states and the five superknowledges.

source: དེ་ནས་ཕྱི་ཞིག་ན་དྲང་སྲོང་རྒན་པོ་དེ་ཤིའོ། །
en: Sometime later the elder sage died,

source: དེ་ཤི་ནས་དྲང་སྲོང་ནག་པོ་གནས་དེ་ཉིད་དུ་འདུག་གོ། །
en: and after his death, Sage Black went on living there.

source: དེ་ནས་ཕྱི་ཞིག་ན་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོའི་ཁབ་ཀྱི་མི་རྣམས་ཀྱིས་གསོལ་བ་བཏབ་སྟེ།
en: One day the people of Rājagṛha beseeched the Blessed One,

source: བཙུན་པ་གནོད་སྦྱིན་ནག་པོ་འདི་ནི། བདག་ཅག་ལ་འཁོན་མ་མཆིས་པར་འཁོན་དུ་འཛིན་པ་ལགས།
en: “Lord, we feel no resentment toward Black the yakṣa, but he resents us so.

source: དགྲ་ཟླ་མ་ལགས་པར་དགྲ་ཟླ་བགྱིད་པ་ལགས་ཏེ། སེམས་ཅན་སྟོང་ཕྲག་དུ་མ་ལ་གནོད་པ་བགྱིད་པ་ལགས་སོ། །
en: We do not intend him harm, but he intends us harm, and he is harming thousands of beings.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ནི་ཀླུ་མ་རུངས་པ་དགའ་བོ་དང་ཉེ་དགའ་བོ་ལ་སོགས་པ་གཞན་དག་ཀྱང་བཏུལ།
en: Lord, the Blessed One has tamed wicked nāgas like Nanda, Upananda , and others besides.

source: གནོད་སྦྱིན་མ་རུངས་པ་འབྲོག་གནས་ལ་སོགས་པ་གཞན་དག་ཀྱང་བཏུལ་ལགས་ན།
en: You have tamed even the wicked yakṣa lord Aṭavika, and others besides.

source: གནོད་སྦྱིན་ནག་པོ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བརྩེ་བའི་སླད་དུ་བཏུལ་ན་ལེགས་ལགས་སོ་ཞེས་གསོལ་ཏོ། །
en: How wonderful it would be if, out of compassion, the Blessed One could tame Black the yakṣa as well.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོའི་ཁབ་ཀྱི་མི་རྣམས་ལ་ཅང་མི་གསུང་བས་གནང་ནས།
en: The Blessed One assented to the people of Rājagṛha by his silence.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་དེ་རྫུ་འཕྲུལ་གྱིས་བཀུག་ནས་བཀའ་སྩལ་པ།
en: The Blessed One used his miraculous powers to summon the yakṣa before him and said,

source: ཀྱེ་སེམས་ཅན་རྣམས་ལ་གནོད་པ་མ་བྱེད་ཅིག །
en: “You must no longer harm beings.

source: སྡིག་པའི་ལས་འདི་ཐོང་ཤིག་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Give up these evil acts.”

source: དེས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་ཇི་ལྟར་བཀའ་སྩལ་པ་དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་གསོལ་ནས།
en: “I shall do as the Blessed One says,” the yakṣa replied,

source: བཅོམ་ལྡན་འདས་ལས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་བླངས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: and he went for refuge and took the fundamental precepts. Then he further promised,
